# Terraform environment prod
#### Format and Style 🖌`success`
#### Initialization ⚙️`success`
#### Validation 🤖`success`
<details><summary>Validation Output</summary>

```


Warning: Deprecated attribute

  on azure_arm.tf line 252, in resource "azurerm_role_assignment" "product_admins_storage_blob_owner":
 252:   scope                = azurerm_storage_container.container.resource_manager_id

The attribute "resource_manager_id" is deprecated. Refer to the provider
documentation for details.

(and 4 more similar warnings elsewhere)
Success! The configuration is valid, but there were some validation warnings
as shown above.


```

</details>

#### Plan 📖`success`

<details><summary>Show Plan</summary>

```

[Lines containing Refreshing state removed]
[Maybe further truncated see logs for complete plan output]
nts" {
      + application_id        = (known after apply)
      + application_object_id = (known after apply)
      + audiences             = [
          + "api://AzureADTokenExchange",
        ]
      + credential_id         = (known after apply)
      + description           = "Allow GitHub actions run within the context of environment 'grafana' from the repository https://github.com/Altinn/dialogporten-frontend to have access to the app registration"
      + display_name          = "github.Altinn.dialogporten-frontend.environment.grafana"
      + id                    = (known after apply)
      + issuer                = "https://token.actions.githubusercontent.com"
      + subject               = "repo:Altinn/dialogporten-frontend:environment:grafana"
    }

  # azuread_application_federated_identity_credential.oidc_environments["ddp-altinn-dialogporten-frontend-dev-test"] will be created
  + resource "azuread_application_federated_identity_credential" "oidc_environments" {
      + application_id        = (known after apply)
      + application_object_id = (known after apply)
      + audiences             = [
          + "api://AzureADTokenExchange",
        ]
      + credential_id         = (known after apply)
      + description           = "Allow GitHub actions run within the context of environment 'test' from the repository https://github.com/Altinn/dialogporten-frontend to have access to the app registration"
      + display_name          = "github.Altinn.dialogporten-frontend.environment.test"
      + id                    = (known after apply)
      + issuer                = "https://token.actions.githubusercontent.com"
      + subject               = "repo:Altinn/dialogporten-frontend:environment:test"
    }

  # azuread_application_federated_identity_credential.oidc_environments["ddp-altinn-dialogporten-frontend-dev-yt01"] will be created
  + resource "azuread_application_federated_identity_credential" "oidc_environments" {
      + application_id        = (known after apply)
      + application_object_id = (known after apply)
      + audiences             = [
          + "api://AzureADTokenExchange",
        ]
      + credential_id         = (known after apply)
      + description           = "Allow GitHub actions run within the context of environment 'yt01' from the repository https://github.com/Altinn/dialogporten-frontend to have access to the app registration"
      + display_name          = "github.Altinn.dialogporten-frontend.environment.yt01"
      + id                    = (known after apply)
      + issuer                = "https://token.actions.githubusercontent.com"
      + subject               = "repo:Altinn/dialogporten-frontend:environment:yt01"
    }

  # azuread_application_federated_identity_credential.oidc_environments["ddp-altinn-dialogporten-frontend-prod-prod"] will be created
  + resource "azuread_application_federated_identity_credential" "oidc_environments" {
      + application_id        = (known after apply)
      + application_object_id = (known after apply)
      + audiences             = [
          + "api://AzureADTokenExchange",
        ]
      + credential_id         = (known after apply)
      + description           = "Allow GitHub actions run within the context of environment 'prod' from the repository https://github.com/Altinn/dialogporten-frontend to have access to the app registration"
      + display_name          = "github.Altinn.dialogporten-frontend.environment.prod"
      + id                    = (known after apply)
      + issuer                = "https://token.actions.githubusercontent.com"
      + subject               = "repo:Altinn/dialogporten-frontend:environment:prod"
    }

  # azuread_application_federated_identity_credential.oidc_environments["ddp-altinn-dialogporten-frontend-prod-staging"] will be created
  + resource "azuread_application_federated_identity_credential" "oidc_environments" {
      + application_id        = (known after apply)
      + application_object_id = (known after apply)
      + audiences             = [
          + "api://AzureADTokenExchange",
        ]
      + credential_id         = (known after apply)
      + description           = "Allow GitHub actions run within the context of environment 'staging' from the repository https://github.com/Altinn/dialogporten-frontend to have access to the app registration"
      + display_name          = "github.Altinn.dialogporten-frontend.environment.staging"
      + id                    = (known after apply)
      + issuer                = "https://token.actions.githubusercontent.com"
      + subject               = "repo:Altinn/dialogporten-frontend:environment:staging"
    }

  # azuread_application_federated_identity_credential.oidc_environments["ddp-altinn-dialogporten-frontend-prod-tt02"] will be created
  + resource "azuread_application_federated_identity_credential" "oidc_environments" {
      + application_id        = (known after apply)
      + application_object_id = (known after apply)
      + audiences             = [
          + "api://AzureADTokenExchange",
        ]
      + credential_id         = (known after apply)
      + description           = "Allow GitHub actions run within the context of environment 'tt02' from the repository https://github.com/Altinn/dialogporten-frontend to have access to the app registration"
      + display_name          = "github.Altinn.dialogporten-frontend.environment.tt02"
      + id                    = (known after apply)
      + issuer                = "https://token.actions.githubusercontent.com"
      + subject               = "repo:Altinn/dialogporten-frontend:environment:tt02"
    }

  # azuread_application_federated_identity_credential.oidc_environments["ddp-altinn-dialogporten-prod-prod"] will be created
  + resource "azuread_application_federated_identity_credential" "oidc_environments" {
      + application_id        = (known after apply)
      + application_object_id = (known after apply)
      + audiences             = [
          + "api://AzureADTokenExchange",
        ]
      + credential_id         = (known after apply)
      + description           = "Allow GitHub actions run within the context of environment 'prod' from the repository https://github.com/Altinn/dialogporten to have access to the app registration"
      + display_name          = "github.Altinn.dialogporten.environment.prod"
      + id                    = (known after apply)
      + issuer                = "https://token.actions.githubusercontent.com"
      + subject               = "repo:Altinn/dialogporten:environment:prod"
    }

  # azuread_application_federated_identity_credential.oidc_environments["ddp-altinn-dialogporten-prod-staging"] will be created
  + resource "azuread_application_federated_identity_credential" "oidc_environments" {
      + application_id        = (known after apply)
      + application_object_id = (known after apply)
      + audiences             = [
          + "api://AzureADTokenExchange",
        ]
      + credential_id         = (known after apply)
      + description           = "Allow GitHub actions run within the context of environment 'staging' from the repository https://github.com/Altinn/dialogporten to have access to the app registration"
      + display_name          = "github.Altinn.dialogporten.environment.staging"
      + id                    = (known after apply)
      + issuer                = "https://token.actions.githubusercontent.com"
      + subject               = "repo:Altinn/dialogporten:environment:staging"
    }

  # azuread_application_federated_identity_credential.oidc_environments["ddp-altinn-dialogporten-prod-tt02"] will be created
  + resource "azuread_application_federated_identity_credential" "oidc_environments" {
      + application_id        = (known after apply)
      + application_object_id = (known after apply)
      + audiences             = [
          + "api://AzureADTokenExchange",
        ]
      + credential_id         = (known after apply)
      + description           = "Allow GitHub actions run within the context of environment 'tt02' from the repository https://github.com/Altinn/dialogporten to have access to the app registration"
      + display_name          = "github.Altinn.dialogporten.environment.tt02"
      + id                    = (known after apply)
      + issuer                = "https://token.actions.githubusercontent.com"
      + subject               = "repo:Altinn/dialogporten:environment:tt02"
    }

  # azuread_application_federated_identity_credential.oidc_environments["ddp-digdir-dialogporten-dev-at21"] will be destroyed
  # (because key ["ddp-digdir-dialogporten-dev-at21"] is not in for_each map)
  - resource "azuread_application_federated_identity_credential" "oidc_environments" {
      - application_id        = "/applications/cfcbc98d-2e76-49af-8ebb-29f286740084" -> null
      - application_object_id = "cfcbc98d-2e76-49af-8ebb-29f286740084" -> null
      - audiences             = [
          - "api://AzureADTokenExchange",
        ] -> null
      - credential_id         = "18b59993-0ba9-47fa-be9a-5912cb40628a" -> null
      - description           = "Allow GitHub actions run within the context of environment 'at21' from the repository https://github.com/digdir/dialogporten to have access to the app registration" -> null
      - display_name          = "github.digdir.dialogporten.environment.at21" -> null
      - id                    = "cfcbc98d-2e76-49af-8ebb-29f286740084/federatedIdentityCredential/18b59993-0ba9-47fa-be9a-5912cb40628a" -> null
      - issuer                = "https://token.actions.githubusercontent.com" -> null
      - subject               = "repo:digdir/dialogporten:environment:at21" -> null
    }

  # azuread_application_federated_identity_credential.oidc_environments["ddp-digdir-dialogporten-dev-at22"] will be destroyed
  # (because key ["ddp-digdir-dialogporten-dev-at22"] is not in for_each map)
  - resource "azuread_application_federated_identity_credential" "oidc_environments" {
      - application_id        = "/applications/cfcbc98d-2e76-49af-8ebb-29f286740084" -> null
      - application_object_id = "cfcbc98d-2e76-49af-8ebb-29f286740084" -> null
      - audiences             = [
          - "api://AzureADTokenExchange",
        ] -> null
      - credential_id         = "8ed8bb87-983a-41e0-b9d2-346f963988f1" -> null
      - description           = "Allow GitHub actions run within the context of environment 'at22' from the repository https://github.com/digdir/dialogporten to have access to the app registration" -> null
      - display_name          = "github.digdir.dialogporten.environment.at22" -> null
      - id                    = "cfcbc98d-2e76-49af-8ebb-29f286740084/federatedIdentityCredential/8ed8bb87-983a-41e0-b9d2-346f963988f1" -> null
      - issuer                = "https://token.actions.githubusercontent.com" -> null
      - subject               = "repo:digdir/dialogporten:environment:at22" -> null
    }

  # azuread_application_federated_identity_credential.oidc_environments["ddp-digdir-dialogporten-dev-at23"] will be destroyed
  # (because key ["ddp-digdir-dialogporten-dev-at23"] is not in for_each map)
  - resource "azuread_application_federated_identity_credential" "oidc_environments" {
      - application_id        = "/applications/cfcbc98d-2e76-49af-8ebb-29f286740084" -> null
      - application_object_id = "cfcbc98d-2e76-49af-8ebb-29f286740084" -> null
      - audiences             = [
          - "api://AzureADTokenExchange",
        ] -> null
      - credential_id         = "79ec1dc5-2d72-444e-9137-fddf5d66694d" -> null
      - description           = "Allow GitHub actions run within the context of environment 'at23' from the repository https://github.com/digdir/dialogporten to have access to the app registration" -> null
      - display_name          = "github.digdir.dialogporten.environment.at23" -> null
      - id                    = "cfcbc98d-2e76-49af-8ebb-29f286740084/federatedIdentityCredential/79ec1dc5-2d72-444e-9137-fddf5d66694d" -> null
      - issuer                = "https://token.actions.githubusercontent.com" -> null
      - subject               = "repo:digdir/dialogporten:environment:at23" -> null
    }

  # azuread_application_federated_identity_credential.oidc_environments["ddp-digdir-dialogporten-dev-at24"] will be destroyed
  # (because key ["ddp-digdir-dialogporten-dev-at24"] is not in for_each map)
  - resource "azuread_application_federated_identity_credential" "oidc_environments" {
      - application_id        = "/applications/cfcbc98d-2e76-49af-8ebb-29f286740084" -> null
      - application_object_id = "cfcbc98d-2e76-49af-8ebb-29f286740084" -> null
      - audiences             = [
          - "api://AzureADTokenExchange",
        ] -> null
      - credential_id         = "d39800eb-1b77-460b-a3e0-ae09a1ae6cb3" -> null
      - description           = "Allow GitHub actions run within the context of environment 'at24' from the repository https://github.com/digdir/dialogporten to have access to the app registration" -> null
      - display_name          = "github.digdir.dialogporten.environment.at24" -> null
      - id                    = "cfcbc98d-2e76-49af-8ebb-29f286740084/federatedIdentityCredential/d39800eb-1b77-460b-a3e0-ae09a1ae6cb3" -> null
      - issuer                = "https://token.actions.githubusercontent.com" -> null
      - subject               = "repo:digdir/dialogporten:environment:at24" -> null
    }

  # azuread_application_federated_identity_credential.oidc_environments["ddp-digdir-dialogporten-dev-at25"] will be destroyed
  # (because key ["ddp-digdir-dialogporten-dev-at25"] is not in for_each map)
  - resource "azuread_application_federated_identity_credential" "oidc_environments" {
      - application_id        = "/applications/cfcbc98d-2e76-49af-8ebb-29f286740084" -> null
      - application_object_id = "cfcbc98d-2e76-49af-8ebb-29f286740084" -> null
      - audiences             = [
          - "api://AzureADTokenExchange",
        ] -> null
      - credential_id         = "7c929e63-5460-46cf-adb9-7cecbb3b6e87" -> null
      - description           = "Allow GitHub actions run within the context of environment 'at25' from the repository https://github.com/digdir/dialogporten to have access to the app registration" -> null
      - display_name          = "github.digdir.dialogporten.environment.at25" -> null
      - id                    = "cfcbc98d-2e76-49af-8ebb-29f286740084/federatedIdentityCredential/7c929e63-5460-46cf-adb9-7cecbb3b6e87" -> null
      - issuer                = "https://token.actions.githubusercontent.com" -> null
      - subject               = "repo:digdir/dialogporten:environment:at25" -> null
    }

  # azuread_application_federated_identity_credential.oidc_environments["ddp-digdir-dialogporten-dev-dev"] will be destroyed
  # (because key ["ddp-digdir-dialogporten-dev-dev"] is not in for_each map)
  - resource "azuread_application_federated_identity_credential" "oidc_environments" {
      - application_id        = "/applications/cfcbc98d-2e76-49af-8ebb-29f286740084" -> null
      - application_object_id = "cfcbc98d-2e76-49af-8ebb-29f286740084" -> null
      - audiences             = [
          - "api://AzureADTokenExchange",
        ] -> null
      - credential_id         = "e254258e-7daf-4069-b047-2d163ac295a2" -> null
      - description           = "Allow GitHub actions run within the context of environment 'dev' from the repository https://github.com/digdir/dialogporten to have access to the app registration" -> null
      - display_name          = "github.digdir.dialogporten.environment.dev" -> null
      - id                    = "cfcbc98d-2e76-49af-8ebb-29f286740084/federatedIdentityCredential/e254258e-7daf-4069-b047-2d163ac295a2" -> null
      - issuer                = "https://token.actions.githubusercontent.com" -> null
      - subject               = "repo:digdir/dialogporten:environment:dev" -> null
    }

  # azuread_application_federated_identity_credential.oidc_environments["ddp-digdir-dialogporten-dev-grafana"] will be destroyed
  # (because key ["ddp-digdir-dialogporten-dev-grafana"] is not in for_each map)
  - resource "azuread_application_federated_identity_credential" "oidc_environments" {
      - application_id        = "/applications/cfcbc98d-2e76-49af-8ebb-29f286740084" -> null
      - application_object_id = "cfcbc98d-2e76-49af-8ebb-29f286740084" -> null
      - audiences             = [
          - "api://AzureADTokenExchange",
        ] -> null
      - credential_id         = "56dc74df-6a8b-4a0f-ad48-e275f44bb55d" -> null
      - description           = "Allow GitHub actions run within the context of environment 'grafana' from the repository https://github.com/digdir/dialogporten to have access to the app registration" -> null
      - display_name          = "github.digdir.dialogporten.environment.grafana" -> null
      - id                    = "cfcbc98d-2e76-49af-8ebb-29f286740084/federatedIdentityCredential/56dc74df-6a8b-4a0f-ad48-e275f44bb55d" -> null
      - issuer                = "https://token.actions.githubusercontent.com" -> null
      - subject               = "repo:digdir/dialogporten:environment:grafana" -> null
    }

  # azuread_application_federated_identity_credential.oidc_environments["ddp-digdir-dialogporten-dev-test"] will be destroyed
  # (because key ["ddp-digdir-dialogporten-dev-test"] is not in for_each map)
  - resource "azuread_application_federated_identity_credential" "oidc_environments" {
      - application_id        = "/applications/cfcbc98d-2e76-49af-8ebb-29f286740084" -> null
      - application_object_id = "cfcbc98d-2e76-49af-8ebb-29f286740084" -> null
      - audiences             = [
          - "api://AzureADTokenExchange",
        ] -> null
      - credential_id         = "44ed808e-149b-428d-9588-f68a67208b73" -> null
      - description           = "Allow GitHub actions run within the context of environment 'test' from the repository https://github.com/digdir/dialogporten to have access to the app registration" -> null
      - display_name          = "github.digdir.dialogporten.environment.test" -> null
      - id                    = "cfcbc98d-2e76-49af-8ebb-29f286740084/federatedIdentityCredential/44ed808e-149b-428d-9588-f68a67208b73" -> null
      - issuer                = "https://token.actions.githubusercontent.com" -> null
      - subject               = "repo:digdir/dialogporten:environment:test" -> null
    }

  # azuread_application_federated_identity_credential.oidc_environments["ddp-digdir-dialogporten-dev-yt01"] will be destroyed
  # (because key ["ddp-digdir-dialogporten-dev-yt01"] is not in for_each map)
  - resource "azuread_application_federated_identity_credential" "oidc_environments" {
      - application_id        = "/applications/cfcbc98d-2e76-49af-8ebb-29f286740084" -> null
      - application_object_id = "cfcbc98d-2e76-49af-8ebb-29f286740084" -> null
      - audiences             = [
          - "api://AzureADTokenExchange",
        ] -> null
      - credential_id         = "ffe73551-41b4-4964-a147-4e06d9bb7af2" -> null
      - description           = "Allow GitHub actions run within the context of environment 'yt01' from the repository https://github.com/digdir/dialogporten to have access to the app registration" -> null
      - display_name          = "github.digdir.dialogporten.environment.yt01" -> null
      - id                    = "cfcbc98d-2e76-49af-8ebb-29f286740084/federatedIdentityCredential/ffe73551-41b4-4964-a147-4e06d9bb7af2" -> null
      - issuer                = "https://token.actions.githubusercontent.com" -> null
      - subject               = "repo:digdir/dialogporten:environment:yt01" -> null
    }

  # azuread_application_federated_identity_credential.oidc_environments["ddp-digdir-dialogporten-frontend-dev-at21"] will be destroyed
  # (because key ["ddp-digdir-dialogporten-frontend-dev-at21"] is not in for_each map)
  - resource "azuread_application_federated_identity_credential" "oidc_environments" {
      - application_id        = "/applications/82556fa2-e45f-4574-b560-f82171ed3272" -> null
      - application_object_id = "82556fa2-e45f-4574-b560-f82171ed3272" -> null
      - audiences             = [
          - "api://AzureADTokenExchange",
        ] -> null
      - credential_id         = "62b6276a-3989-4e57-a64e-2106c1435961" -> null
      - description           = "Allow GitHub actions run within the context of environment 'at21' from the repository https://github.com/digdir/dialogporten-frontend to have access to the app registration" -> null
      - display_name          = "github.digdir.dialogporten-frontend.environment.at21" -> null
      - id                    = "82556fa2-e45f-4574-b560-f82171ed3272/federatedIdentityCredential/62b6276a-3989-4e57-a64e-2106c1435961" -> null
      - issuer                = "https://token.actions.githubusercontent.com" -> null
      - subject               = "repo:digdir/dialogporten-frontend:environment:at21" -> null
    }

  # azuread_application_federated_identity_credential.oidc_environments["ddp-digdir-dialogporten-frontend-dev-at22"] will be destroyed
  # (because key ["ddp-digdir-dialogporten-frontend-dev-at22"] is not in for_each map)
  - resource "azuread_application_federated_identity_credential" "oidc_environments" {
      - application_id        = "/applications/82556fa2-e45f-4574-b560-f82171ed3272" -> null
      - application_object_id = "82556fa2-e45f-4574-b560-f82171ed3272" -> null
      - audiences             = [
          - "api://AzureADTokenExchange",
        ] -> null
      - credential_id         = "bbe50ae1-7456-4ffc-9e02-e95aa8e9d228" -> null
      - description           = "Allow GitHub actions run within the context of environment 'at22' from the repository https://github.com/digdir/dialogporten-frontend to have access to the app registration" -> null
      - display_name          = "github.digdir.dialogporten-frontend.environment.at22" -> null
      - id                    = "82556fa2-e45f-4574-b560-f82171ed3272/federatedIdentityCredential/bbe50ae1-7456-4ffc-9e02-e95aa8e9d228" -> null
      - issuer                = "https://token.actions.githubusercontent.com" -> null
      - subject               = "repo:digdir/dialogporten-frontend:environment:at22" -> null
    }

  # azuread_application_federated_identity_credential.oidc_environments["ddp-digdir-dialogporten-frontend-dev-at23"] will be destroyed
  # (because key ["ddp-digdir-dialogporten-frontend-dev-at23"] is not in for_each map)
  - resource "azuread_application_federated_identity_credential" "oidc_environments" {
      - application_id        = "/applications/82556fa2-e45f-4574-b560-f82171ed3272" -> null
      - application_object_id = "82556fa2-e45f-4574-b560-f82171ed3272" -> null
      - audiences             = [
          - "api://AzureADTokenExchange",
        ] -> null
      - credential_id         = "e6d65feb-e336-4023-95fe-92cdb463e1df" -> null
      - description           = "Allow GitHub actions run within the context of environment 'at23' from the repository https://github.com/digdir/dialogporten-frontend to have access to the app registration" -> null
      - display_name          = "github.digdir.dialogporten-frontend.environment.at23" -> null
      - id                    = "82556fa2-e45f-4574-b560-f82171ed3272/federatedIdentityCredential/e6d65feb-e336-4023-95fe-92cdb463e1df" -> null
      - issuer                = "https://token.actions.githubusercontent.com" -> null
      - subject               = "repo:digdir/dialogporten-frontend:environment:at23" -> null
    }

  # azuread_application_federated_identity_credential.oidc_environments["ddp-digdir-dialogporten-frontend-dev-at24"] will be destroyed
  # (because key ["ddp-digdir-dialogporten-frontend-dev-at24"] is not in for_each map)
  - resource "azuread_application_federated_identity_credential" "oidc_environments" {
      - application_id        = "/applications/82556fa2-e45f-4574-b560-f82171ed3272" -> null
      - application_object_id = "82556fa2-e45f-4574-b560-f82171ed3272" -> null
      - audiences             = [
          - "api://AzureADTokenExchange",
        ] -> null
      - credential_id         = "7218f6e3-eec9-45c5-a2c7-34de52eb2443" -> null
      - description           = "Allow GitHub actions run within the context of environment 'at24' from the repository https://github.com/digdir/dialogporten-frontend to have access to the app registration" -> null
      - display_name          = "github.digdir.dialogporten-frontend.environment.at24" -> null
      - id                    = "82556fa2-e45f-4574-b560-f82171ed3272/federatedIdentityCredential/7218f6e3-eec9-45c5-a2c7-34de52eb2443" -> null
      - issuer                = "https://token.actions.githubusercontent.com" -> null
      - subject               = "repo:digdir/dialogporten-frontend:environment:at24" -> null
    }

  # azuread_application_federated_identity_credential.oidc_environments["ddp-digdir-dialogporten-frontend-dev-at25"] will be destroyed
  # (because key ["ddp-digdir-dialogporten-frontend-dev-at25"] is not in for_each map)
  - resource "azuread_application_federated_identity_credential" "oidc_environments" {
      - application_id        = "/applications/82556fa2-e45f-4574-b560-f82171ed3272" -> null
      - application_object_id = "82556fa2-e45f-4574-b560-f82171ed3272" -> null
      - audiences             = [
          - "api://AzureADTokenExchange",
        ] -> null
      - credential_id         = "550adf3d-2c58-4513-9298-d11856d6aa1c" -> null
      - description           = "Allow GitHub actions run within the context of environment 'at25' from the repository https://github.com/digdir/dialogporten-frontend to have access to the app registration" -> null
      - display_name          = "github.digdir.dialogporten-frontend.environment.at25" -> null
      - id                    = "82556fa2-e45f-4574-b560-f82171ed3272/federatedIdentityCredential/550adf3d-2c58-4513-9298-d11856d6aa1c" -> null
      - issuer                = "https://token.actions.githubusercontent.com" -> null
      - subject               = "repo:digdir/dialogporten-frontend:environment:at25" -> null
    }

  # azuread_application_federated_identity_credential.oidc_environments["ddp-digdir-dialogporten-frontend-dev-dev"] will be destroyed
  # (because key ["ddp-digdir-dialogporten-frontend-dev-dev"] is not in for_each map)
  - resource "azuread_application_federated_identity_credential" "oidc_environments" {
      - application_id        = "/applications/82556fa2-e45f-4574-b560-f82171ed3272" -> null
      - application_object_id = "82556fa2-e45f-4574-b560-f82171ed3272" -> null
      - audiences             = [
          - "api://AzureADTokenExchange",
        ] -> null
      - credential_id         = "93200667-0bf8-4b9c-9c93-cdd89391a54c" -> null
      - description           = "Allow GitHub actions run within the context of environment 'dev' from the repository https://github.com/digdir/dialogporten-frontend to have access to the app registration" -> null
      - display_name          = "github.digdir.dialogporten-frontend.environment.dev" -> null
      - id                    = "82556fa2-e45f-4574-b560-f82171ed3272/federatedIdentityCredential/93200667-0bf8-4b9c-9c93-cdd89391a54c" -> null
      - issuer                = "https://token.actions.githubusercontent.com" -> null
      - subject               = "repo:digdir/dialogporten-frontend:environment:dev" -> null
    }

  # azuread_application_federated_identity_credential.oidc_environments["ddp-digdir-dialogporten-frontend-dev-grafana"] will be destroyed
  # (because key ["ddp-digdir-dialogporten-frontend-dev-grafana"] is not in for_each map)
  - resource "azuread_application_federated_identity_credential" "oidc_environments" {
      - application_id        = "/applications/82556fa2-e45f-4574-b560-f82171ed3272" -> null
      - application_object_id = "82556fa2-e45f-4574-b560-f82171ed3272" -> null
      - audiences             = [
          - "api://AzureADTokenExchange",
        ] -> null
      - credential_id         = "be54fbad-f14f-4323-814a-1af3654f163f" -> null
      - description           = "Allow GitHub actions run within the context of environment 'grafana' from the repository https://github.com/digdir/dialogporten-frontend to have access to the app registration" -> null
      - display_name          = "github.digdir.dialogporten-frontend.environment.grafana" -> null
      - id                    = "82556fa2-e45f-4574-b560-f82171ed3272/federatedIdentityCredential/be54fbad-f14f-4323-814a-1af3654f163f" -> null
      - issuer                = "https://token.actions.githubusercontent.com" -> null
      - subject               = "repo:digdir/dialogporten-frontend:environment:grafana" -> null
    }

  # azuread_application_federated_identity_credential.oidc_environments["ddp-digdir-dialogporten-frontend-dev-test"] will be destroyed
  # (because key ["ddp-digdir-dialogporten-frontend-dev-test"] is not in for_each map)
  - resource "azuread_application_federated_identity_credential" "oidc_environments" {
      - application_id        = "/applications/82556fa2-e45f-4574-b560-f82171ed3272" -> null
      - application_object_id = "82556fa2-e45f-4574-b560-f82171ed3272" -> null
      - audiences             = [
          - "api://AzureADTokenExchange",
        ] -> null
      - credential_id         = "3199b003-3602-4ebe-bca0-7dc4eaf4d3dc" -> null
      - description           = "Allow GitHub actions run within the context of environment 'test' from the repository https://github.com/digdir/dialogporten-frontend to have access to the app registration" -> null
      - display_name          = "github.digdir.dialogporten-frontend.environment.test" -> null
      - id                    = "82556fa2-e45f-4574-b560-f82171ed3272/federatedIdentityCredential/3199b003-3602-4ebe-bca0-7dc4eaf4d3dc" -> null
      - issuer                = "https://token.actions.githubusercontent.com" -> null
      - subject               = "repo:digdir/dialogporten-frontend:environment:test" -> null
    }

  # azuread_application_federated_identity_credential.oidc_environments["ddp-digdir-dialogporten-frontend-dev-yt01"] will be destroyed
  # (because key ["ddp-digdir-dialogporten-frontend-dev-yt01"] is not in for_each map)
  - resource "azuread_application_federated_identity_credential" "oidc_environments" {
      - application_id        = "/applications/82556fa2-e45f-4574-b560-f82171ed3272" -> null
      - application_object_id = "82556fa2-e45f-4574-b560-f82171ed3272" -> null
      - audiences             = [
          - "api://AzureADTokenExchange",
        ] -> null
      - credential_id         = "087ba363-e9f5-40b2-832f-f788b3d2d53d" -> null
      - description           = "Allow GitHub actions run within the context of environment 'yt01' from the repository https://github.com/digdir/dialogporten-frontend to have access to the app registration" -> null
      - display_name          = "github.digdir.dialogporten-frontend.environment.yt01" -> null
      - id                    = "82556fa2-e45f-4574-b560-f82171ed3272/federatedIdentityCredential/087ba363-e9f5-40b2-832f-f788b3d2d53d" -> null
      - issuer                = "https://token.actions.githubusercontent.com" -> null
      - subject               = "repo:digdir/dialogporten-frontend:environment:yt01" -> null
    }

  # azuread_application_federated_identity_credential.oidc_environments["ddp-digdir-dialogporten-frontend-prod-prod"] will be destroyed
  # (because key ["ddp-digdir-dialogporten-frontend-prod-prod"] is not in for_each map)
  - resource "azuread_application_federated_identity_credential" "oidc_environments" {
      - application_id        = "/applications/37961029-aa8f-4fca-a716-fd4e41fa8a4c" -> null
      - application_object_id = "37961029-aa8f-4fca-a716-fd4e41fa8a4c" -> null
      - audiences             = [
          - "api://AzureADTokenExchange",
        ] -> null
      - credential_id         = "88761082-0a48-4b72-b381-cfccd616002c" -> null
      - description           = "Allow GitHub actions run within the context of environment 'prod' from the repository https://github.com/digdir/dialogporten-frontend to have access to the app registration" -> null
      - display_name          = "github.digdir.dialogporten-frontend.environment.prod" -> null
      - id                    = "37961029-aa8f-4fca-a716-fd4e41fa8a4c/federatedIdentityCredential/88761082-0a48-4b72-b381-cfccd616002c" -> null
      - issuer                = "https://token.actions.githubusercontent.com" -> null
      - subject               = "repo:digdir/dialogporten-frontend:environment:prod" -> null
    }

  # azuread_application_federated_identity_credential.oidc_environments["ddp-digdir-dialogporten-frontend-prod-staging"] will be destroyed
  # (because key ["ddp-digdir-dialogporten-frontend-prod-staging"] is not in for_each map)
  - resource "azuread_application_federated_identity_credential" "oidc_environments" {
      - application_id        = "/applications/37961029-aa8f-4fca-a716-fd4e41fa8a4c" -> null
      - application_object_id = "37961029-aa8f-4fca-a716-fd4e41fa8a4c" -> null
      - audiences             = [
          - "api://AzureADTokenExchange",
        ] -> null
      - credential_id         = "4dd03aa0-dbac-480c-ae28-17b442d665a2" -> null
      - description           = "Allow GitHub actions run within the context of environment 'staging' from the repository https://github.com/digdir/dialogporten-frontend to have access to the app registration" -> null
      - display_name          = "github.digdir.dialogporten-frontend.environment.staging" -> null
      - id                    = "37961029-aa8f-4fca-a716-fd4e41fa8a4c/federatedIdentityCredential/4dd03aa0-dbac-480c-ae28-17b442d665a2" -> null
      - issuer                = "https://token.actions.githubusercontent.com" -> null
      - subject               = "repo:digdir/dialogporten-frontend:environment:staging" -> null
    }

  # azuread_application_federated_identity_credential.oidc_environments["ddp-digdir-dialogporten-frontend-prod-tt02"] will be destroyed
  # (because key ["ddp-digdir-dialogporten-frontend-prod-tt02"] is not in for_each map)
  - resource "azuread_application_federated_identity_credential" "oidc_environments" {
      - application_id        = "/applications/37961029-aa8f-4fca-a716-fd4e41fa8a4c" -> null
      - application_object_id = "37961029-aa8f-4fca-a716-fd4e41fa8a4c" -> null
      - audiences             = [
          - "api://AzureADTokenExchange",
        ] -> null
      - credential_id         = "1d52c13e-8b62-4197-966c-df46b307e14a" -> null
      - description           = "Allow GitHub actions run within the context of environment 'tt02' from the repository https://github.com/digdir/dialogporten-frontend to have access to the app registration" -> null
      - display_name          = "github.digdir.dialogporten-frontend.environment.tt02" -> null
      - id                    = "37961029-aa8f-4fca-a716-fd4e41fa8a4c/federatedIdentityCredential/1d52c13e-8b62-4197-966c-df46b307e14a" -> null
      - issuer                = "https://token.actions.githubusercontent.com" -> null
      - subject               = "repo:digdir/dialogporten-frontend:environment:tt02" -> null
    }

  # azuread_application_federated_identity_credential.oidc_environments["ddp-digdir-dialogporten-prod-prod"] will be destroyed
  # (because key ["ddp-digdir-dialogporten-prod-prod"] is not in for_each map)
  - resource "azuread_application_federated_identity_credential" "oidc_environments" {
      - application_id        = "/applications/7b6bf5c2-0aba-4a1e-a905-4eb9224a1762" -> null
      - application_object_id = "7b6bf5c2-0aba-4a1e-a905-4eb9224a1762" -> null
      - audiences             = [
          - "api://AzureADTokenExchange",
        ] -> null
      - credential_id         = "c0b09f9c-446b-42fc-a5e1-145dc216d525" -> null
      - description           = "Allow GitHub actions run within the context of environment 'prod' from the repository https://github.com/digdir/dialogporten to have access to the app registration" -> null
      - display_name          = "github.digdir.dialogporten.environment.prod" -> null
      - id                    = "7b6bf5c2-0aba-4a1e-a905-4eb9224a1762/federatedIdentityCredential/c0b09f9c-446b-42fc-a5e1-145dc216d525" -> null
      - issuer                = "https://token.actions.githubusercontent.com" -> null
      - subject               = "repo:digdir/dialogporten:environment:prod" -> null
    }

  # azuread_application_federated_identity_credential.oidc_environments["ddp-digdir-dialogporten-prod-staging"] will be destroyed
  # (because key ["ddp-digdir-dialogporten-prod-staging"] is not in for_each map)
  - resource "azuread_application_federated_identity_credential" "oidc_environments" {
      - application_id        = "/applications/7b6bf5c2-0aba-4a1e-a905-4eb9224a1762" -> null
      - application_object_id = "7b6bf5c2-0aba-4a1e-a905-4eb9224a1762" -> null
      - audiences             = [
          - "api://AzureADTokenExchange",
        ] -> null
      - credential_id         = "0997bc15-4ea6-4b8e-8657-fa0362e045ea" -> null
      - description           = "Allow GitHub actions run within the context of environment 'staging' from the repository https://github.com/digdir/dialogporten to have access to the app registration" -> null
      - display_name          = "github.digdir.dialogporten.environment.staging" -> null
      - id                    = "7b6bf5c2-0aba-4a1e-a905-4eb9224a1762/federatedIdentityCredential/0997bc15-4ea6-4b8e-8657-fa0362e045ea" -> null
      - issuer                = "https://token.actions.githubusercontent.com" -> null
      - subject               = "repo:digdir/dialogporten:environment:staging" -> null
    }

  # azuread_application_federated_identity_credential.oidc_environments["ddp-digdir-dialogporten-prod-tt02"] will be destroyed
  # (because key ["ddp-digdir-dialogporten-prod-tt02"] is not in for_each map)
  - resource "azuread_application_federated_identity_credential" "oidc_environments" {
      - application_id        = "/applications/7b6bf5c2-0aba-4a1e-a905-4eb9224a1762" -> null
      - application_object_id = "7b6bf5c2-0aba-4a1e-a905-4eb9224a1762" -> null
      - audiences             = [
          - "api://AzureADTokenExchange",
        ] -> null
      - credential_id         = "887136a2-3c48-4c27-88e8-014012792036" -> null
      - description           = "Allow GitHub actions run within the context of environment 'tt02' from the repository https://github.com/digdir/dialogporten to have access to the app registration" -> null
      - display_name          = "github.digdir.dialogporten.environment.tt02" -> null
      - id                    = "7b6bf5c2-0aba-4a1e-a905-4eb9224a1762/federatedIdentityCredential/887136a2-3c48-4c27-88e8-014012792036" -> null
      - issuer                = "https://token.actions.githubusercontent.com" -> null
      - subject               = "repo:digdir/dialogporten:environment:tt02" -> null
    }

  # azuread_service_principal.product["ddp-altinn-dialogporten-dev"] will be created
  + resource "azuread_service_principal" "product" {
      + account_enabled             = true
      + app_role_ids                = (known after apply)
      + app_roles                   = (known after apply)
      + application_id              = (known after apply)
      + application_tenant_id       = (known after apply)
      + client_id                   = (known after apply)
      + display_name                = (known after apply)
      + homepage_url                = (known after apply)
      + id                          = (known after apply)
      + logout_url                  = (known after apply)
      + oauth2_permission_scope_ids = (known after apply)
      + oauth2_permission_scopes    = (known after apply)
      + object_id                   = (known after apply)
      + redirect_uris               = (known after apply)
      + saml_metadata_url           = (known after apply)
      + service_principal_names     = (known after apply)
      + sign_in_audience            = (known after apply)
      + tags                        = (known after apply)
      + type                        = (known after apply)
    }

  # azuread_service_principal.product["ddp-altinn-dialogporten-frontend-dev"] will be created
  + resource "azuread_service_principal" "product" {
      + account_enabled             = true
      + app_role_ids                = (known after apply)
      + app_roles                   = (known after apply)
      + application_id              = (known after apply)
      + application_tenant_id       = (known after apply)
      + client_id                   = (known after apply)
      + display_name                = (known after apply)
      + homepage_url                = (known after apply)
      + id                          = (known after apply)
      + logout_url                  = (known after apply)
      + oauth2_permission_scope_ids = (known after apply)
      + oauth2_permission_scopes    = (known after apply)
      + object_id                   = (known after apply)
      + redirect_uris               = (known after apply)
      + saml_metadata_url           = (known after apply)
      + service_principal_names     = (known after apply)
      + sign_in_audience            = (known after apply)
      + tags                        = (known after apply)
      + type                        = (known after apply)
    }

  # azuread_service_principal.product["ddp-altinn-dialogporten-frontend-prod"] will be created
  + resource "azuread_service_principal" "product" {
      + account_enabled             = true
      + app_role_ids                = (known after apply)
      + app_roles                   = (known after apply)
      + application_id              = (known after apply)
      + application_tenant_id       = (known after apply)
      + client_id                   = (known after apply)
      + display_name                = (known after apply)
      + homepage_url                = (known after apply)
      + id                          = (known after apply)
      + logout_url                  = (known after apply)
      + oauth2_permission_scope_ids = (known after apply)
      + oauth2_permission_scopes    = (known after apply)
      + object_id                   = (known after apply)
      + redirect_uris               = (known after apply)
      + saml_metadata_url           = (known after apply)
      + service_principal_names     = (known after apply)
      + sign_in_audience            = (known after apply)
      + tags                        = (known after apply)
      + type                        = (known after apply)
    }

  # azuread_service_principal.product["ddp-altinn-dialogporten-prod"] will be created
  + resource "azuread_service_principal" "product" {
      + account_enabled             = true
      + app_role_ids                = (known after apply)
      + app_roles                   = (known after apply)
      + application_id              = (known after apply)
      + application_tenant_id       = (known after apply)
      + client_id                   = (known after apply)
      + display_name                = (known after apply)
      + homepage_url                = (known after apply)
      + id                          = (known after apply)
      + logout_url                  = (known after apply)
      + oauth2_permission_scope_ids = (known after apply)
      + oauth2_permission_scopes    = (known after apply)
      + object_id                   = (known after apply)
      + redirect_uris               = (known after apply)
      + saml_metadata_url           = (known after apply)
      + service_principal_names     = (known after apply)
      + sign_in_audience            = (known after apply)
      + tags                        = (known after apply)
      + type                        = (known after apply)
    }

  # azuread_service_principal.product["ddp-digdir-dialogporten-dev"] will be destroyed
  # (because key ["ddp-digdir-dialogporten-dev"] is not in for_each map)
  - resource "azuread_service_principal" "product" {
      - account_enabled              = true -> null
      - alternative_names            = [] -> null
      - app_role_assignment_required = false -> null
      - app_role_ids                 = {} -> null
      - app_roles                    = [] -> null
      - application_id               = "414b27b3-bdcb-49b0-b259-a142c7fe30af" -> null
      - application_tenant_id        = "cd0026d8-283b-4a55-9bfa-d0ef4a8ba21c" -> null
      - client_id                    = "414b27b3-bdcb-49b0-b259-a142c7fe30af" -> null
      - display_name                 = "GitHub: digdir/dialogporten - Dev" -> null
      - id                           = "871fb027-f695-4936-b80a-c035462305d8" -> null
      - notification_email_addresses = [] -> null
      - oauth2_permission_scope_ids  = {} -> null
      - oauth2_permission_scopes     = [] -> null
      - object_id                    = "871fb027-f695-4936-b80a-c035462305d8" -> null
      - owners                       = [] -> null
      - redirect_uris                = [] -> null
      - service_principal_names      = [] -> null
      - sign_in_audience             = "AzureADMyOrg" -> null
      - tags                         = [] -> null
      - type                         = "Application" -> null

      - feature_tags {
          - custom_single_sign_on = false -> null
          - enterprise            = false -> null
          - gallery               = false -> null
          - hide                  = false -> null
        }

      - features {
          - custom_single_sign_on_app = false -> null
          - enterprise_application    = false -> null
          - gallery_application       = false -> null
          - visible_to_users          = true -> null
        }

      - saml_single_sign_on {}
    }

  # azuread_service_principal.product["ddp-digdir-dialogporten-frontend-dev"] will be destroyed
  # (because key ["ddp-digdir-dialogporten-frontend-dev"] is not in for_each map)
  - resource "azuread_service_principal" "product" {
      - account_enabled              = true -> null
      - alternative_names            = [] -> null
      - app_role_assignment_required = false -> null
      - app_role_ids                 = {} -> null
      - app_roles                    = [] -> null
      - application_id               = "7cc552b4-31b7-4460-8228-85981242ca04" -> null
      - application_tenant_id        = "cd0026d8-283b-4a55-9bfa-d0ef4a8ba21c" -> null
      - client_id                    = "7cc552b4-31b7-4460-8228-85981242ca04" -> null
      - display_name                 = "GitHub: digdir/dialogporten-frontend - Dev" -> null
      - id                           = "04218107-d720-4b10-8b45-6f4404170511" -> null
      - notification_email_addresses = [] -> null
      - oauth2_permission_scope_ids  = {} -> null
      - oauth2_permission_scopes     = [] -> null
      - object_id                    = "04218107-d720-4b10-8b45-6f4404170511" -> null
      - owners                       = [] -> null
      - redirect_uris                = [] -> null
      - service_principal_names      = [] -> null
      - sign_in_audience             = "AzureADMyOrg" -> null
      - tags                         = [] -> null
      - type                         = "Application" -> null

      - feature_tags {
          - custom_single_sign_on = false -> null
          - enterprise            = false -> null
          - gallery               = false -> null
          - hide                  = false -> null
        }

      - features {
          - custom_single_sign_on_app = false -> null
          - enterprise_application    = false -> null
          - gallery_application       = false -> null
          - visible_to_users          = true -> null
        }

      - saml_single_sign_on {}
    }

  # azuread_service_principal.product["ddp-digdir-dialogporten-frontend-prod"] will be destroyed
  # (because key ["ddp-digdir-dialogporten-frontend-prod"] is not in for_each map)
  - resource "azuread_service_principal" "product" {
      - account_enabled              = true -> null
      - alternative_names            = [] -> null
      - app_role_assignment_required = false -> null
      - app_role_ids                 = {} -> null
      - app_roles                    = [] -> null
      - application_id               = "862759ca-44e7-4af8-bfc5-06dd13db299a" -> null
      - application_tenant_id        = "cd0026d8-283b-4a55-9bfa-d0ef4a8ba21c" -> null
      - client_id                    = "862759ca-44e7-4af8-bfc5-06dd13db299a" -> null
      - display_name                 = "GitHub: digdir/dialogporten-frontend - Prod" -> null
      - id                           = "d1a822c0-d5e4-4f7e-9793-b296efcf1dee" -> null
      - notification_email_addresses = [] -> null
      - oauth2_permission_scope_ids  = {} -> null
      - oauth2_permission_scopes     = [] -> null
      - object_id                    = "d1a822c0-d5e4-4f7e-9793-b296efcf1dee" -> null
      - owners                       = [] -> null
      - redirect_uris                = [] -> null
      - service_principal_names      = [] -> null
      - sign_in_audience             = "AzureADMyOrg" -> null
      - tags                         = [] -> null
      - type                         = "Application" -> null

      - feature_tags {
          - custom_single_sign_on = false -> null
          - enterprise            = false -> null
          - gallery               = false -> null
          - hide                  = false -> null
        }

      - features {
          - custom_single_sign_on_app = false -> null
          - enterprise_application    = false -> null
          - gallery_application       = false -> null
          - visible_to_users          = true -> null
        }

      - saml_single_sign_on {}
    }

  # azuread_service_principal.product["ddp-digdir-dialogporten-prod"] will be destroyed
  # (because key ["ddp-digdir-dialogporten-prod"] is not in for_each map)
  - resource "azuread_service_principal" "product" {
      - account_enabled              = true -> null
      - alternative_names            = [] -> null
      - app_role_assignment_required = false -> null
      - app_role_ids                 = {} -> null
      - app_roles                    = [] -> null
      - application_id               = "cc663f64-0ca5-4d64-8d2c-6ecf2552bdf8" -> null
      - application_tenant_id        = "cd0026d8-283b-4a55-9bfa-d0ef4a8ba21c" -> null
      - client_id                    = "cc663f64-0ca5-4d64-8d2c-6ecf2552bdf8" -> null
      - display_name                 = "GitHub: digdir/dialogporten - Prod" -> null
      - id                           = "1ab67334-88c1-4c95-8849-96b64f2035fa" -> null
      - notification_email_addresses = [] -> null
      - oauth2_permission_scope_ids  = {} -> null
      - oauth2_permission_scopes     = [] -> null
      - object_id                    = "1ab67334-88c1-4c95-8849-96b64f2035fa" -> null
      - owners                       = [] -> null
      - redirect_uris                = [] -> null
      - service_principal_names      = [] -> null
      - sign_in_audience             = "AzureADMyOrg" -> null
      - tags                         = [] -> null
      - type                         = "Application" -> null

      - feature_tags {
          - custom_single_sign_on = false -> null
          - enterprise            = false -> null
          - gallery               = false -> null
          - hide                  = false -> null
        }

      - features {
          - custom_single_sign_on_app = false -> null
          - enterprise_application    = false -> null
          - gallery_application       = false -> null
          - visible_to_users          = true -> null
        }

      - saml_single_sign_on {}
    }

  # azurerm_app_configuration.state will be updated in-place
  ~ resource "azurerm_app_configuration" "state" {
        id                         = "/subscriptions/d43d5057-8389-40d5-88c4-04db9275cbf2/resourceGroups/terraform-rg/providers/Microsoft.AppConfiguration/configurationStores/altinnterraformappconf02"
        name                       = "altinnterraformappconf02"
      ~ tags                       = {
          - "costcenter" = "altinn3"
          - "createdAt"  = "09-07-2024 09:55:43 UTC"
          - "createdBy"  = "Bengt Rino Fredh"
          - "modifiedAt" = "07-01-2025 11:19:22 UTC"
          - "modifiedBy" = "GitHub: Altinn/altinn-platform - Reader"
          - "repository" = "github.com/Altinn/altinn-platform"
          - "solution"   = "platform"
        } -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # azurerm_role_assignment.appregg["ddp-altinn-dialogporten-dev"] will be created
  + resource "azurerm_role_assignment" "appregg" {
      + condition                        = <<-EOT
            (
             (
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/write'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/add/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/runAsSuperUser/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/tags/write'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/delete'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/deleteBlobVersion/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/immutableStorage/runAsSuperUser/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/move/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/manageOwnership/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/permanentDelete/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/modifyPermissions/action'})
            )
            
             OR
             (
              
              @Resource[Microsoft.Storage/storageAccounts/blobServices/containers/blobs:path] StringStartsWith 'github.com/altinn/dialogporten/environments/dev'
              OR
              
              @Resource[Microsoft.Storage/storageAccounts/blobServices/containers/blobs:path] StringStartsWith 'github.com/altinn/dialogporten/environments/test'
              OR
              
              @Resource[Microsoft.Storage/storageAccounts/blobServices/containers/blobs:path] StringStartsWith 'github.com/altinn/dialogporten/environments/at21'
              OR
              
              @Resource[Microsoft.Storage/storageAccounts/blobServices/containers/blobs:path] StringStartsWith 'github.com/altinn/dialogporten/environments/at22'
              OR
              
              @Resource[Microsoft.Storage/storageAccounts/blobServices/containers/blobs:path] StringStartsWith 'github.com/altinn/dialogporten/environments/at23'
              OR
              
              @Resource[Microsoft.Storage/storageAccounts/blobServices/containers/blobs:path] StringStartsWith 'github.com/altinn/dialogporten/environments/at24'
              OR
              
              @Resource[Microsoft.Storage/storageAccounts/blobServices/containers/blobs:path] StringStartsWith 'github.com/altinn/dialogporten/environments/at25'
              OR
              
              @Resource[Microsoft.Storage/storageAccounts/blobServices/containers/blobs:path] StringStartsWith 'github.com/altinn/dialogporten/environments/yt01'
              OR
              
              @Resource[Microsoft.Storage/storageAccounts/blobServices/containers/blobs:path] StringStartsWith 'github.com/altinn/dialogporten/environments/grafana'
              OR
                  @Resource[Microsoft.Storage/storageAccounts/blobServices/containers/blobs:path] StringStartsWith 'github.com/altinn/~/EOT'
             )
            )
        EOT
      + condition_version                = "2.0"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Owner"
      + scope                            = "/subscriptions/d43d5057-8389-40d5-88c4-04db9275cbf2/resourceGroups/terraform-rg/providers/Microsoft.Storage/storageAccounts/altinnterraformstorage02/blobServices/default/containers/tfstates"
      + skip_service_principal_aad_check = true
    }

  # azurerm_role_assignment.appregg["ddp-altinn-dialogporten-frontend-dev"] will be created
  + resource "azurerm_role_assignment" "appregg" {
      + condition                        = <<-EOT
            (
             (
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/write'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/add/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/runAsSuperUser/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/tags/write'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/delete'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/deleteBlobVersion/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/immutableStorage/runAsSuperUser/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/move/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/manageOwnership/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/permanentDelete/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/modifyPermissions/action'})
            )
            
             OR
             (
              
              @Resource[Microsoft.Storage/storageAccounts/blobServices/containers/blobs:path] StringStartsWith 'github.com/altinn/dialogporten-frontend/environments/dev'
              OR
              
              @Resource[Microsoft.Storage/storageAccounts/blobServices/containers/blobs:path] StringStartsWith 'github.com/altinn/dialogporten-frontend/environments/test'
              OR
              
              @Resource[Microsoft.Storage/storageAccounts/blobServices/containers/blobs:path] StringStartsWith 'github.com/altinn/dialogporten-frontend/environments/at21'
              OR
              
              @Resource[Microsoft.Storage/storageAccounts/blobServices/containers/blobs:path] StringStartsWith 'github.com/altinn/dialogporten-frontend/environments/at22'
              OR
              
              @Resource[Microsoft.Storage/storageAccounts/blobServices/containers/blobs:path] StringStartsWith 'github.com/altinn/dialogporten-frontend/environments/at23'
              OR
              
              @Resource[Microsoft.Storage/storageAccounts/blobServices/containers/blobs:path] StringStartsWith 'github.com/altinn/dialogporten-frontend/environments/at24'
              OR
              
              @Resource[Microsoft.Storage/storageAccounts/blobServices/containers/blobs:path] StringStartsWith 'github.com/altinn/dialogporten-frontend/environments/at25'
              OR
              
              @Resource[Microsoft.Storage/storageAccounts/blobServices/containers/blobs:path] StringStartsWith 'github.com/altinn/dialogporten-frontend/environments/yt01'
              OR
              
              @Resource[Microsoft.Storage/storageAccounts/blobServices/containers/blobs:path] StringStartsWith 'github.com/altinn/dialogporten-frontend/environments/grafana'
              OR
                  @Resource[Microsoft.Storage/storageAccounts/blobServices/containers/blobs:path] StringStartsWith 'github.com/altinn/~/EOT'
             )
            )
        EOT
      + condition_version                = "2.0"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Owner"
      + scope                            = "/subscriptions/d43d5057-8389-40d5-88c4-04db9275cbf2/resourceGroups/terraform-rg/providers/Microsoft.Storage/storageAccounts/altinnterraformstorage02/blobServices/default/containers/tfstates"
      + skip_service_principal_aad_check = true
    }

  # azurerm_role_assignment.appregg["ddp-altinn-dialogporten-frontend-prod"] will be created
  + resource "azurerm_role_assignment" "appregg" {
      + condition                        = <<-EOT
            (
             (
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/write'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/add/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/runAsSuperUser/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/tags/write'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/delete'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/deleteBlobVersion/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/immutableStorage/runAsSuperUser/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/move/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/manageOwnership/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/permanentDelete/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/modifyPermissions/action'})
            )
            
             OR
             (
              
              @Resource[Microsoft.Storage/storageAccounts/blobServices/containers/blobs:path] StringStartsWith 'github.com/altinn/dialogporten-frontend/environments/staging'
              OR
              
              @Resource[Microsoft.Storage/storageAccounts/blobServices/containers/blobs:path] StringStartsWith 'github.com/altinn/dialogporten-frontend/environments/tt02'
              OR
              
              @Resource[Microsoft.Storage/storageAccounts/blobServices/containers/blobs:path] StringStartsWith 'github.com/altinn/dialogporten-frontend/environments/prod'
              OR
                  @Resource[Microsoft.Storage/storageAccounts/blobServices/containers/blobs:path] StringStartsWith 'github.com/altinn/~/EOT'
             )
            )
        EOT
      + condition_version                = "2.0"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Owner"
      + scope                            = "/subscriptions/d43d5057-8389-40d5-88c4-04db9275cbf2/resourceGroups/terraform-rg/providers/Microsoft.Storage/storageAccounts/altinnterraformstorage02/blobServices/default/containers/tfstates"
      + skip_service_principal_aad_check = true
    }

  # azurerm_role_assignment.appregg["ddp-altinn-dialogporten-prod"] will be created
  + resource "azurerm_role_assignment" "appregg" {
      + condition                        = <<-EOT
            (
             (
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/write'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/add/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/runAsSuperUser/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/tags/write'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/delete'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/deleteBlobVersion/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/immutableStorage/runAsSuperUser/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/move/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/manageOwnership/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/permanentDelete/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/modifyPermissions/action'})
            )
            
             OR
             (
              
              @Resource[Microsoft.Storage/storageAccounts/blobServices/containers/blobs:path] StringStartsWith 'github.com/altinn/dialogporten/environments/staging'
              OR
              
              @Resource[Microsoft.Storage/storageAccounts/blobServices/containers/blobs:path] StringStartsWith 'github.com/altinn/dialogporten/environments/tt02'
              OR
              
              @Resource[Microsoft.Storage/storageAccounts/blobServices/containers/blobs:path] StringStartsWith 'github.com/altinn/dialogporten/environments/prod'
              OR
                  @Resource[Microsoft.Storage/storageAccounts/blobServices/containers/blobs:path] StringStartsWith 'github.com/altinn/~/EOT'
             )
            )
        EOT
      + condition_version                = "2.0"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Owner"
      + scope                            = "/subscriptions/d43d5057-8389-40d5-88c4-04db9275cbf2/resourceGroups/terraform-rg/providers/Microsoft.Storage/storageAccounts/altinnterraformstorage02/blobServices/default/containers/tfstates"
      + skip_service_principal_aad_check = true
    }

  # azurerm_role_assignment.appregg["ddp-digdir-dialogporten-dev"] will be destroyed
  # (because key ["ddp-digdir-dialogporten-dev"] is not in for_each map)
  - resource "azurerm_role_assignment" "appregg" {
      - condition                        = <<-EOT
            (
             (
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/write'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/add/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/runAsSuperUser/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/tags/write'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/delete'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/deleteBlobVersion/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/immutableStorage/runAsSuperUser/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/move/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/manageOwnership/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/permanentDelete/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/modifyPermissions/action'})
            )
            
             OR
             (
              
              @Resource[Microsoft.Storage/storageAccounts/blobServices/containers/blobs:path] StringStartsWith 'github.com/digdir/dialogporten/environments/dev'
              OR
              
              @Resource[Microsoft.Storage/storageAccounts/blobServices/containers/blobs:path] StringStartsWith 'github.com/digdir/dialogporten/environments/test'
              OR
              
              @Resource[Microsoft.Storage/storageAccounts/blobServices/containers/blobs:path] StringStartsWith 'github.com/digdir/dialogporten/environments/at21'
              OR
              
              @Resource[Microsoft.Storage/storageAccounts/blobServices/containers/blobs:path] StringStartsWith 'github.com/digdir/dialogporten/environments/at22'
              OR
              
              @Resource[Microsoft.Storage/storageAccounts/blobServices/containers/blobs:path] StringStartsWith 'github.com/digdir/dialogporten/environments/at23'
              OR
              
              @Resource[Microsoft.Storage/storageAccounts/blobServices/containers/blobs:path] StringStartsWith 'github.com/digdir/dialogporten/environments/at24'
              OR
              
              @Resource[Microsoft.Storage/storageAccounts/blobServices/containers/blobs:path] StringStartsWith 'github.com/digdir/dialogporten/environments/at25'
              OR
              
              @Resource[Microsoft.Storage/storageAccounts/blobServices/containers/blobs:path] StringStartsWith 'github.com/digdir/dialogporten/environments/yt01'
              OR
              
              @Resource[Microsoft.Storage/storageAccounts/blobServices/containers/blobs:path] StringStartsWith 'github.com/digdir/dialogporten/environments/grafana'
              OR
                  @Resource[Microsoft.Storage/storageAccounts/blobServices/containers/blobs:path] StringStartsWith 'github.com/digdir/~/EOT'
             )
            )
        EOT -> null
      - condition_version                = "2.0" -> null
      - id                               = "/subscriptions/d43d5057-8389-40d5-88c4-04db9275cbf2/resourceGroups/terraform-rg/providers/Microsoft.Storage/storageAccounts/altinnterraformstorage02/blobServices/default/containers/tfstates/providers/Microsoft.Authorization/roleAssignments/f35ea0af-09f5-8d67-e175-2a6b16942734" -> null
      - name                             = "f35ea0af-09f5-8d67-e175-2a6b16942734" -> null
      - principal_id                     = "871fb027-f695-4936-b80a-c035462305d8" -> null
      - principal_type                   = "ServicePrincipal" -> null
      - role_definition_id               = "/subscriptions/d43d5057-8389-40d5-88c4-04db9275cbf2/providers/Microsoft.Authorization/roleDefinitions/b7e6dc6d-f1e8-4753-8033-0f276bb0955b" -> null
      - role_definition_name             = "Storage Blob Data Owner" -> null
      - scope                            = "/subscriptions/d43d5057-8389-40d5-88c4-04db9275cbf2/resourceGroups/terraform-rg/providers/Microsoft.Storage/storageAccounts/altinnterraformstorage02/blobServices/default/containers/tfstates" -> null
      - skip_service_principal_aad_check = true -> null
    }

  # azurerm_role_assignment.appregg["ddp-digdir-dialogporten-frontend-dev"] will be destroyed
  # (because key ["ddp-digdir-dialogporten-frontend-dev"] is not in for_each map)
  - resource "azurerm_role_assignment" "appregg" {
      - condition                        = <<-EOT
            (
             (
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/write'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/add/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/runAsSuperUser/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/tags/write'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/delete'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/deleteBlobVersion/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/immutableStorage/runAsSuperUser/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/move/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/manageOwnership/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/permanentDelete/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/modifyPermissions/action'})
            )
            
             OR
             (
              
              @Resource[Microsoft.Storage/storageAccounts/blobServices/containers/blobs:path] StringStartsWith 'github.com/digdir/dialogporten-frontend/environments/dev'
              OR
              
              @Resource[Microsoft.Storage/storageAccounts/blobServices/containers/blobs:path] StringStartsWith 'github.com/digdir/dialogporten-frontend/environments/test'
              OR
              
              @Resource[Microsoft.Storage/storageAccounts/blobServices/containers/blobs:path] StringStartsWith 'github.com/digdir/dialogporten-frontend/environments/at21'
              OR
              
              @Resource[Microsoft.Storage/storageAccounts/blobServices/containers/blobs:path] StringStartsWith 'github.com/digdir/dialogporten-frontend/environments/at22'
              OR
              
              @Resource[Microsoft.Storage/storageAccounts/blobServices/containers/blobs:path] StringStartsWith 'github.com/digdir/dialogporten-frontend/environments/at23'
              OR
              
              @Resource[Microsoft.Storage/storageAccounts/blobServices/containers/blobs:path] StringStartsWith 'github.com/digdir/dialogporten-frontend/environments/at24'
              OR
              
              @Resource[Microsoft.Storage/storageAccounts/blobServices/containers/blobs:path] StringStartsWith 'github.com/digdir/dialogporten-frontend/environments/at25'
              OR
              
              @Resource[Microsoft.Storage/storageAccounts/blobServices/containers/blobs:path] StringStartsWith 'github.com/digdir/dialogporten-frontend/environments/yt01'
              OR
              
              @Resource[Microsoft.Storage/storageAccounts/blobServices/containers/blobs:path] StringStartsWith 'github.com/digdir/dialogporten-frontend/environments/grafana'
              OR
                  @Resource[Microsoft.Storage/storageAccounts/blobServices/containers/blobs:path] StringStartsWith 'github.com/digdir/~/EOT'
             )
            )
        EOT -> null
      - condition_version                = "2.0" -> null
      - id                               = "/subscriptions/d43d5057-8389-40d5-88c4-04db9275cbf2/resourceGroups/terraform-rg/providers/Microsoft.Storage/storageAccounts/altinnterraformstorage02/blobServices/default/containers/tfstates/providers/Microsoft.Authorization/roleAssignments/4207dcfd-52b3-dfd6-d24d-32340e458311" -> null
      - name                             = "4207dcfd-52b3-dfd6-d24d-32340e458311" -> null
      - principal_id                     = "04218107-d720-4b10-8b45-6f4404170511" -> null
      - principal_type                   = "ServicePrincipal" -> null
      - role_definition_id               = "/subscriptions/d43d5057-8389-40d5-88c4-04db9275cbf2/providers/Microsoft.Authorization/roleDefinitions/b7e6dc6d-f1e8-4753-8033-0f276bb0955b" -> null
      - role_definition_name             = "Storage Blob Data Owner" -> null
      - scope                            = "/subscriptions/d43d5057-8389-40d5-88c4-04db9275cbf2/resourceGroups/terraform-rg/providers/Microsoft.Storage/storageAccounts/altinnterraformstorage02/blobServices/default/containers/tfstates" -> null
      - skip_service_principal_aad_check = true -> null
    }

  # azurerm_role_assignment.appregg["ddp-digdir-dialogporten-frontend-prod"] will be destroyed
  # (because key ["ddp-digdir-dialogporten-frontend-prod"] is not in for_each map)
  - resource "azurerm_role_assignment" "appregg" {
      - condition                        = <<-EOT
            (
             (
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/write'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/add/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/runAsSuperUser/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/tags/write'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/delete'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/deleteBlobVersion/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/immutableStorage/runAsSuperUser/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/move/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/manageOwnership/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/permanentDelete/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/modifyPermissions/action'})
            )
            
             OR
             (
              
              @Resource[Microsoft.Storage/storageAccounts/blobServices/containers/blobs:path] StringStartsWith 'github.com/digdir/dialogporten-frontend/environments/staging'
              OR
              
              @Resource[Microsoft.Storage/storageAccounts/blobServices/containers/blobs:path] StringStartsWith 'github.com/digdir/dialogporten-frontend/environments/tt02'
              OR
              
              @Resource[Microsoft.Storage/storageAccounts/blobServices/containers/blobs:path] StringStartsWith 'github.com/digdir/dialogporten-frontend/environments/prod'
              OR
                  @Resource[Microsoft.Storage/storageAccounts/blobServices/containers/blobs:path] StringStartsWith 'github.com/digdir/~/EOT'
             )
            )
        EOT -> null
      - condition_version                = "2.0" -> null
      - id                               = "/subscriptions/d43d5057-8389-40d5-88c4-04db9275cbf2/resourceGroups/terraform-rg/providers/Microsoft.Storage/storageAccounts/altinnterraformstorage02/blobServices/default/containers/tfstates/providers/Microsoft.Authorization/roleAssignments/78eaf0c6-4404-ff56-4e77-8df284302e32" -> null
      - name                             = "78eaf0c6-4404-ff56-4e77-8df284302e32" -> null
      - principal_id                     = "d1a822c0-d5e4-4f7e-9793-b296efcf1dee" -> null
      - principal_type                   = "ServicePrincipal" -> null
      - role_definition_id               = "/subscriptions/d43d5057-8389-40d5-88c4-04db9275cbf2/providers/Microsoft.Authorization/roleDefinitions/b7e6dc6d-f1e8-4753-8033-0f276bb0955b" -> null
      - role_definition_name             = "Storage Blob Data Owner" -> null
      - scope                            = "/subscriptions/d43d5057-8389-40d5-88c4-04db9275cbf2/resourceGroups/terraform-rg/providers/Microsoft.Storage/storageAccounts/altinnterraformstorage02/blobServices/default/containers/tfstates" -> null
      - skip_service_principal_aad_check = true -> null
    }

  # azurerm_role_assignment.appregg["ddp-digdir-dialogporten-prod"] will be destroyed
  # (because key ["ddp-digdir-dialogporten-prod"] is not in for_each map)
  - resource "azurerm_role_assignment" "appregg" {
      - condition                        = <<-EOT
            (
             (
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/write'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/add/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/runAsSuperUser/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/tags/write'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/delete'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/deleteBlobVersion/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/immutableStorage/runAsSuperUser/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/move/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/manageOwnership/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/permanentDelete/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/modifyPermissions/action'})
            )
            
             OR
             (
              
              @Resource[Microsoft.Storage/storageAccounts/blobServices/containers/blobs:path] StringStartsWith 'github.com/digdir/dialogporten/environments/staging'
              OR
              
              @Resource[Microsoft.Storage/storageAccounts/blobServices/containers/blobs:path] StringStartsWith 'github.com/digdir/dialogporten/environments/tt02'
              OR
              
              @Resource[Microsoft.Storage/storageAccounts/blobServices/containers/blobs:path] StringStartsWith 'github.com/digdir/dialogporten/environments/prod'
              OR
                  @Resource[Microsoft.Storage/storageAccounts/blobServices/containers/blobs:path] StringStartsWith 'github.com/digdir/~/EOT'
             )
            )
        EOT -> null
      - condition_version                = "2.0" -> null
      - id                               = "/subscriptions/d43d5057-8389-40d5-88c4-04db9275cbf2/resourceGroups/terraform-rg/providers/Microsoft.Storage/storageAccounts/altinnterraformstorage02/blobServices/default/containers/tfstates/providers/Microsoft.Authorization/roleAssignments/a686d8a3-df3a-6921-b326-43278001b93f" -> null
      - name                             = "a686d8a3-df3a-6921-b326-43278001b93f" -> null
      - principal_id                     = "1ab67334-88c1-4c95-8849-96b64f2035fa" -> null
      - principal_type                   = "ServicePrincipal" -> null
      - role_definition_id               = "/subscriptions/d43d5057-8389-40d5-88c4-04db9275cbf2/providers/Microsoft.Authorization/roleDefinitions/b7e6dc6d-f1e8-4753-8033-0f276bb0955b" -> null
      - role_definition_name             = "Storage Blob Data Owner" -> null
      - scope                            = "/subscriptions/d43d5057-8389-40d5-88c4-04db9275cbf2/resourceGroups/terraform-rg/providers/Microsoft.Storage/storageAccounts/altinnterraformstorage02/blobServices/default/containers/tfstates" -> null
      - skip_service_principal_aad_check = true -> null
    }

  # azurerm_role_assignment.apps_contributor["ddp-altinn-dialogporten-dev"] will be created
  + resource "azurerm_role_assignment" "apps_contributor" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = "/providers/Microsoft.Management/managementGroups/DDP-Dev"
      + skip_service_principal_aad_check = true
    }

  # azurerm_role_assignment.apps_contributor["ddp-altinn-dialogporten-frontend-dev"] will be created
  + resource "azurerm_role_assignment" "apps_contributor" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = "/providers/Microsoft.Management/managementGroups/DDP-Dev"
      + skip_service_principal_aad_check = true
    }

  # azurerm_role_assignment.apps_contributor["ddp-altinn-dialogporten-frontend-prod"] will be created
  + resource "azurerm_role_assignment" "apps_contributor" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = "/providers/Microsoft.Management/managementGroups/DDP-Prod"
      + skip_service_principal_aad_check = true
    }

  # azurerm_role_assignment.apps_contributor["ddp-altinn-dialogporten-prod"] will be created
  + resource "azurerm_role_assignment" "apps_contributor" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = "/providers/Microsoft.Management/managementGroups/DDP-Prod"
      + skip_service_principal_aad_check = true
    }

  # azurerm_role_assignment.apps_contributor["ddp-digdir-dialogporten-dev"] will be destroyed
  # (because key ["ddp-digdir-dialogporten-dev"] is not in for_each map)
  - resource "azurerm_role_assignment" "apps_contributor" {
      - id                               = "/providers/Microsoft.Management/managementGroups/DDP-Dev/providers/Microsoft.Authorization/roleAssignments/46690bda-163e-66e1-ab4b-950e99637882" -> null
      - name                             = "46690bda-163e-66e1-ab4b-950e99637882" -> null
      - principal_id                     = "871fb027-f695-4936-b80a-c035462305d8" -> null
      - principal_type                   = "ServicePrincipal" -> null
      - role_definition_id               = "/providers/Microsoft.Authorization/roleDefinitions/b24988ac-6180-42a0-ab88-20f7382dd24c" -> null
      - role_definition_name             = "Contributor" -> null
      - scope                            = "/providers/Microsoft.Management/managementGroups/DDP-Dev" -> null
      - skip_service_principal_aad_check = true -> null
    }

  # azurerm_role_assignment.apps_contributor["ddp-digdir-dialogporten-frontend-dev"] will be destroyed
  # (because key ["ddp-digdir-dialogporten-frontend-dev"] is not in for_each map)
  - resource "azurerm_role_assignment" "apps_contributor" {
      - id                               = "/providers/Microsoft.Management/managementGroups/DDP-Dev/providers/Microsoft.Authorization/roleAssignments/0f3740d7-b342-182e-10a5-1c44d4a6aad1" -> null
      - name                             = "0f3740d7-b342-182e-10a5-1c44d4a6aad1" -> null
      - principal_id                     = "04218107-d720-4b10-8b45-6f4404170511" -> null
      - principal_type                   = "ServicePrincipal" -> null
      - role_definition_id               = "/providers/Microsoft.Authorization/roleDefinitions/b24988ac-6180-42a0-ab88-20f7382dd24c" -> null
      - role_definition_name             = "Contributor" -> null
      - scope                            = "/providers/Microsoft.Management/managementGroups/DDP-Dev" -> null
      - skip_service_principal_aad_check = true -> null
    }

  # azurerm_role_assignment.apps_contributor["ddp-digdir-dialogporten-frontend-prod"] will be destroyed
  # (because key ["ddp-digdir-dialogporten-frontend-prod"] is not in for_each map)
  - resource "azurerm_role_assignment" "apps_contributor" {
      - id                               = "/providers/Microsoft.Management/managementGroups/DDP-Prod/providers/Microsoft.Authorization/roleAssignments/5f9695c6-49a4-1cef-6582-df4cfcb3a3e1" -> null
      - name                             = "5f9695c6-49a4-1cef-6582-df4cfcb3a3e1" -> null
      - principal_id                     = "d1a822c0-d5e4-4f7e-9793-b296efcf1dee" -> null
      - principal_type                   = "ServicePrincipal" -> null
      - role_definition_id               = "/providers/Microsoft.Authorization/roleDefinitions/b24988ac-6180-42a0-ab88-20f7382dd24c" -> null
      - role_definition_name             = "Contributor" -> null
      - scope                            = "/providers/Microsoft.Management/managementGroups/DDP-Prod" -> null
      - skip_service_principal_aad_check = true -> null
    }

  # azurerm_role_assignment.apps_contributor["ddp-digdir-dialogporten-prod"] will be destroyed
  # (because key ["ddp-digdir-dialogporten-prod"] is not in for_each map)
  - resource "azurerm_role_assignment" "apps_contributor" {
      - id                               = "/providers/Microsoft.Management/managementGroups/DDP-Prod/providers/Microsoft.Authorization/roleAssignments/58de2712-0caf-bb15-f9ac-157514ec8f88" -> null
      - name                             = "58de2712-0caf-bb15-f9ac-157514ec8f88" -> null
      - principal_id                     = "1ab67334-88c1-4c95-8849-96b64f2035fa" -> null
      - principal_type                   = "ServicePrincipal" -> null
      - role_definition_id               = "/providers/Microsoft.Authorization/roleDefinitions/b24988ac-6180-42a0-ab88-20f7382dd24c" -> null
      - role_definition_name             = "Contributor" -> null
      - scope                            = "/providers/Microsoft.Management/managementGroups/DDP-Prod" -> null
      - skip_service_principal_aad_check = true -> null
    }

  # azurerm_role_assignment.apps_user_access_administrator["ddp-altinn-dialogporten-dev"] will be created
  + resource "azurerm_role_assignment" "apps_user_access_administrator" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "User Access Administrator"
      + scope                            = "/providers/Microsoft.Management/managementGroups/DDP-Dev"
      + skip_service_principal_aad_check = true
    }

  # azurerm_role_assignment.apps_user_access_administrator["ddp-altinn-dialogporten-frontend-dev"] will be created
  + resource "azurerm_role_assignment" "apps_user_access_administrator" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "User Access Administrator"
      + scope                            = "/providers/Microsoft.Management/managementGroups/DDP-Dev"
      + skip_service_principal_aad_check = true
    }

  # azurerm_role_assignment.apps_user_access_administrator["ddp-altinn-dialogporten-frontend-prod"] will be created
  + resource "azurerm_role_assignment" "apps_user_access_administrator" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "User Access Administrator"
      + scope                            = "/providers/Microsoft.Management/managementGroups/DDP-Prod"
      + skip_service_principal_aad_check = true
    }

  # azurerm_role_assignment.apps_user_access_administrator["ddp-altinn-dialogporten-prod"] will be created
  + resource "azurerm_role_assignment" "apps_user_access_administrator" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "User Access Administrator"
      + scope                            = "/providers/Microsoft.Management/managementGroups/DDP-Prod"
      + skip_service_principal_aad_check = true
    }

  # azurerm_role_assignment.apps_user_access_administrator["ddp-digdir-dialogporten-dev"] will be destroyed
  # (because key ["ddp-digdir-dialogporten-dev"] is not in for_each map)
  - resource "azurerm_role_assignment" "apps_user_access_administrator" {
      - id                               = "/providers/Microsoft.Management/managementGroups/DDP-Dev/providers/Microsoft.Authorization/roleAssignments/1373e0b8-a03a-4a45-73a8-4723418d91c6" -> null
      - name                             = "1373e0b8-a03a-4a45-73a8-4723418d91c6" -> null
      - principal_id                     = "871fb027-f695-4936-b80a-c035462305d8" -> null
      - principal_type                   = "ServicePrincipal" -> null
      - role_definition_id               = "/providers/Microsoft.Authorization/roleDefinitions/18d7d88d-d35e-4fb5-a5c3-7773c20a72d9" -> null
      - role_definition_name             = "User Access Administrator" -> null
      - scope                            = "/providers/Microsoft.Management/managementGroups/DDP-Dev" -> null
      - skip_service_principal_aad_check = true -> null
    }

  # azurerm_role_assignment.apps_user_access_administrator["ddp-digdir-dialogporten-frontend-dev"] will be destroyed
  # (because key ["ddp-digdir-dialogporten-frontend-dev"] is not in for_each map)
  - resource "azurerm_role_assignment" "apps_user_access_administrator" {
      - id                               = "/providers/Microsoft.Management/managementGroups/DDP-Dev/providers/Microsoft.Authorization/roleAssignments/aad2b7a4-ac98-b75f-76db-88be9ce43356" -> null
      - name                             = "aad2b7a4-ac98-b75f-76db-88be9ce43356" -> null
      - principal_id                     = "04218107-d720-4b10-8b45-6f4404170511" -> null
      - principal_type                   = "ServicePrincipal" -> null
      - role_definition_id               = "/providers/Microsoft.Authorization/roleDefinitions/18d7d88d-d35e-4fb5-a5c3-7773c20a72d9" -> null
      - role_definition_name             = "User Access Administrator" -> null
      - scope                            = "/providers/Microsoft.Management/managementGroups/DDP-Dev" -> null
      - skip_service_principal_aad_check = true -> null
    }

  # azurerm_role_assignment.apps_user_access_administrator["ddp-digdir-dialogporten-frontend-prod"] will be destroyed
  # (because key ["ddp-digdir-dialogporten-frontend-prod"] is not in for_each map)
  - resource "azurerm_role_assignment" "apps_user_access_administrator" {
      - id                               = "/providers/Microsoft.Management/managementGroups/DDP-Prod/providers/Microsoft.Authorization/roleAssignments/cfa7e8fa-bdde-eab2-dc44-b2af765ff3a7" -> null
      - name                             = "cfa7e8fa-bdde-eab2-dc44-b2af765ff3a7" -> null
      - principal_id                     = "d1a822c0-d5e4-4f7e-9793-b296efcf1dee" -> null
      - principal_type                   = "ServicePrincipal" -> null
      - role_definition_id               = "/providers/Microsoft.Authorization/roleDefinitions/18d7d88d-d35e-4fb5-a5c3-7773c20a72d9" -> null
      - role_definition_name             = "User Access Administrator" -> null
      - scope                            = "/providers/Microsoft.Management/managementGroups/DDP-Prod" -> null
      - skip_service_principal_aad_check = true -> null
    }

  # azurerm_role_assignment.apps_user_access_administrator["ddp-digdir-dialogporten-prod"] will be destroyed
  # (because key ["ddp-digdir-dialogporten-prod"] is not in for_each map)
  - resource "azurerm_role_assignment" "apps_user_access_administrator" {
      - id                               = "/providers/Microsoft.Management/managementGroups/DDP-Prod/providers/Microsoft.Authorization/roleAssignments/db43100c-235d-996f-5a3f-97ebe8b4ba81" -> null
      - name                             = "db43100c-235d-996f-5a3f-97ebe8b4ba81" -> null
      - principal_id                     = "1ab67334-88c1-4c95-8849-96b64f2035fa" -> null
      - principal_type                   = "ServicePrincipal" -> null
      - role_definition_id               = "/providers/Microsoft.Authorization/roleDefinitions/18d7d88d-d35e-4fb5-a5c3-7773c20a72d9" -> null
      - role_definition_name             = "User Access Administrator" -> null
      - scope                            = "/providers/Microsoft.Management/managementGroups/DDP-Prod" -> null
      - skip_service_principal_aad_check = true -> null
    }

  # azurerm_role_assignment.products["ddp-dev"] must be replaced
-/+ resource "azurerm_role_assignment" "products" {
      ~ condition                        = <<-EOT # forces replacement
            (
              (
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/write'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/add/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/runAsSuperUser/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/tags/write'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/delete'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/deleteBlobVersion/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/immutableStorage/runAsSuperUser/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/move/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/manageOwnership/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/permanentDelete/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/modifyPermissions/action'})
            )
            
              OR
              (
                
          -       @Resource[Microsoft.Storage/storageAccounts/blobServices/containers/blobs:path] StringStartsWith 'github.com/digdir/dialogporten'
          +       @Resource[Microsoft.Storage/storageAccounts/blobServices/containers/blobs:path] StringStartsWith 'github.com/altinn/dialogporten'
                  OR
                
          -       @Resource[Microsoft.Storage/storageAccounts/blobServices/containers/blobs:path] StringStartsWith 'github.com/digdir/dialogporten-frontend'
          +       @Resource[Microsoft.Storage/storageAccounts/blobServices/containers/blobs:path] StringStartsWith 'github.com/altinn/dialogporten-frontend'
                  OR
          -           @Resource[Microsoft.Storage/storageAccounts/blobServices/containers/blobs:path] StringStartsWith 'github.com/digdir/~/EOT'
          +           @Resource[Microsoft.Storage/storageAccounts/blobServices/containers/blobs:path] StringStartsWith 'github.com/altinn/~/EOT'
              )
            )
        EOT
      ~ id                               = "/subscriptions/d43d5057-8389-40d5-88c4-04db9275cbf2/resourceGroups/terraform-rg/providers/Microsoft.Storage/storageAccounts/altinnterraformstorage02/blobServices/default/containers/tfstates/providers/Microsoft.Authorization/roleAssignments/0e797e2f-b09e-e514-1469-8c771a8293df" -> (known after apply)
      ~ name                             = "0e797e2f-b09e-e514-1469-8c771a8293df" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/d43d5057-8389-40d5-88c4-04db9275cbf2/providers/Microsoft.Authorization/roleDefinitions/b7e6dc6d-f1e8-4753-8033-0f276bb0955b" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # azurerm_role_assignment.products["ddp-prod"] must be replaced
-/+ resource "azurerm_role_assignment" "products" {
      ~ condition                        = <<-EOT # forces replacement
            (
              (
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/write'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/add/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/runAsSuperUser/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/tags/write'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/delete'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/deleteBlobVersion/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/immutableStorage/runAsSuperUser/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/move/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/manageOwnership/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/permanentDelete/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/modifyPermissions/action'})
            )
            
              OR
              (
                
          -       @Resource[Microsoft.Storage/storageAccounts/blobServices/containers/blobs:path] StringStartsWith 'github.com/digdir/dialogporten'
          +       @Resource[Microsoft.Storage/storageAccounts/blobServices/containers/blobs:path] StringStartsWith 'github.com/altinn/dialogporten'
                  OR
                
          -       @Resource[Microsoft.Storage/storageAccounts/blobServices/containers/blobs:path] StringStartsWith 'github.com/digdir/dialogporten-frontend'
          +       @Resource[Microsoft.Storage/storageAccounts/blobServices/containers/blobs:path] StringStartsWith 'github.com/altinn/dialogporten-frontend'
                  OR
          -           @Resource[Microsoft.Storage/storageAccounts/blobServices/containers/blobs:path] StringStartsWith 'github.com/digdir/~/EOT'
          +           @Resource[Microsoft.Storage/storageAccounts/blobServices/containers/blobs:path] StringStartsWith 'github.com/altinn/~/EOT'
              )
            )
        EOT
      ~ id                               = "/subscriptions/d43d5057-8389-40d5-88c4-04db9275cbf2/resourceGroups/terraform-rg/providers/Microsoft.Storage/storageAccounts/altinnterraformstorage02/blobServices/default/containers/tfstates/providers/Microsoft.Authorization/roleAssignments/2bd7a0b7-9586-c425-e50a-49d00454993f" -> (known after apply)
      ~ name                             = "2bd7a0b7-9586-c425-e50a-49d00454993f" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/d43d5057-8389-40d5-88c4-04db9275cbf2/providers/Microsoft.Authorization/roleDefinitions/b7e6dc6d-f1e8-4753-8033-0f276bb0955b" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # azurerm_storage_account.backend will be updated in-place
  ~ resource "azurerm_storage_account" "backend" {
        id                                = "/subscriptions/d43d5057-8389-40d5-88c4-04db9275cbf2/resourceGroups/terraform-rg/providers/Microsoft.Storage/storageAccounts/altinnterraformstorage02"
        name                              = "altinnterraformstorage02"
      ~ tags                              = {
          - "costcenter" = "altinn3"
          - "createdAt"  = "09-07-2024 09:55:43 UTC"
          - "createdBy"  = "Bengt Rino Fredh"
          - "modifiedAt" = "07-01-2025 11:19:22 UTC"
          - "modifiedBy" = "GitHub: Altinn/altinn-platform - Reader"
          - "repository" = "github.com/Altinn/altinn-platform"
          - "solution"   = "platform"
        } -> (known after apply)
        # (35 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 51 to add, 4 to change, 50 to destroy.

Warning: Argument is deprecated

  with azurerm_storage_container.container,
  on azure_arm.tf line 145, in resource "azurerm_storage_container" "container":
 145:   storage_account_name = azurerm_storage_account.backend.name

the storage_account_name property has been deprecated in favour of
storage_account_id and will be removed in version 5.0 of the Provider.

Warning: Deprecated attribute

  on azure_arm.tf line 252, in resource "azurerm_role_assignment" "product_admins_storage_blob_owner":
 252:   scope                = azurerm_storage_container.container.resource_manager_id

The attribute "resource_manager_id" is deprecated. Refer to the provider
documentation for details.

(and 39 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.out"
Releasing state lock. This may take a few moments...

```

</details>

| Context | Values |
| - | - |
| Pusher | @tjololo |
| Action | `pull_request` |
| Working Directory | `./infrastructure/products` |
| State File | `github.com/altinn/altinn-platform/environments/prod/products.tfstate` |
| Plan File | `github.com_altinn_altinn-platform_environments_prod_products.tfstate.tfplan`